assets/test/sample_discount_order_dol.json

{
    "Attributes": [],
    "CurrencyCode": "USD",
    "Data": null,
    "HandlingDiscount": null,
    "HandlingDiscounts": null,
    "HandlingFee": 0.0,
    "LineItems": [
        {
            "Data": null,
            "DestinationAddress": null,
            "DiscountTotal": 0.0,
            "DiscountedTotal": 100.0,
            "FeeTotal": 0.0,
            "HandlingAmount": null,
            "Id": "975947826ab54211852ca92d0106865d",
            "IsTaxable": true,
            "LineItemPrice": 98.62,
            "OriginAddress": null,
            "ProductCode": "1006",
            "ProductDiscount": null,
            "ProductDiscounts": [],
            "ProductName": "Parsons Trench-89 Pump",
            "ProductProperties": [
                {
                    "AttributeDetail": {
                        "DataType": null,
                        "Description": null,
                        "InputType": null,
                        "Name": "Availability",
                        "ValueType": null
                    },
                    "AttributeFQN": "tenant~availability",
                    "IsHidden": null,
                    "IsMultiValue": false,
                    "Values": [
                        {
                            "StringValue": "Usually Ships in 24 Hours",
                            "Value": "24hrs"
                        }
                    ]
                }
            ],
            "Quantity": 2,
            "Reason": null,
            "ShippingAmount": 30.0,
            "ShippingDiscount": null,
            "ShippingDiscounts": [],
            "VariantProductCode": null
        },
        {
            "Data": null,
            "DestinationAddress": null,
            "DiscountTotal": 0.0,
            "DiscountedTotal": 260.0,
            "FeeTotal": 0.0,
            "HandlingAmount": null,
            "Id": "9919d03ef34c42dba79ea92d011f5707",
            "IsTaxable": true,
            "LineItemPrice": 256.41,
            "OriginAddress": null,
            "ProductCode": "1011",
            "ProductDiscount": null,
            "ProductDiscounts": [],
            "ProductName": "Reid Mira Pump",
            "ProductProperties": [
                {
                    "AttributeDetail": {
                        "DataType": null,
                        "Description": null,
                        "InputType": null,
                        "Name": "Availability",
                        "ValueType": null
                    },
                    "AttributeFQN": "tenant~availability",
                    "IsHidden": null,
                    "IsMultiValue": false,
                    "Values": [
                        {
                            "StringValue": "Usually Ships in 24 Hours",
                            "Value": "24hrs"
                        }
                    ]
                }
            ],
            "Quantity": 2,
            "Reason": null,
            "ShippingAmount": 30.0,
            "ShippingDiscount": null,
            "ShippingDiscounts": [],
            "VariantProductCode": null
        },
        {
            "Data": null,
            "DestinationAddress": null,
            "DiscountTotal": 0.0,
            "DiscountedTotal": 120.0,
            "FeeTotal": 0.0,
            "HandlingAmount": null,
            "Id": "114209d419d5406c9936a92d01269223",
            "IsTaxable": true,
            "LineItemPrice": 118.35,
            "OriginAddress": null,
            "ProductCode": "1005",
            "ProductDiscount": null,
            "ProductDiscounts": [],
            "ProductName": "Piona Kailas Patent Pump",
            "ProductProperties": [
                {
                    "AttributeDetail": {
                        "DataType": null,
                        "Description": null,
                        "InputType": null,
                        "Name": "Availability",
                        "ValueType": null
                    },
                    "AttributeFQN": "tenant~availability",
                    "IsHidden": null,
                    "IsMultiValue": false,
                    "Values": [
                        {
                            "StringValue": "Usually Ships in 24 Hours",
                            "Value": "24hrs"
                        }
                    ]
                }
            ],
            "Quantity": 2,
            "Reason": null,
            "ShippingAmount": 30.0,
            "ShippingDiscount": null,
            "ShippingDiscounts": [],
            "VariantProductCode": null
        },
        {
            "Data": null,
            "DestinationAddress": null,
            "DiscountTotal": 0.0,
            "DiscountedTotal": 245.0,
            "FeeTotal": 0.0,
            "HandlingAmount": null,
            "Id": "b8910813edb24f12b893a92d013e6585",
            "IsTaxable": false,
            "LineItemPrice": 241.62,
            "OriginAddress": null,
            "ProductCode": "1004",
            "ProductDiscount": null,
            "ProductDiscounts": [],
            "ProductName": "Laurel Ann Imagen Pump",
            "ProductProperties": [
                {
                    "AttributeDetail": {
                        "DataType": null,
                        "Description": null,
                        "InputType": null,
                        "Name": "Availability",
                        "ValueType": null
                    },
                    "AttributeFQN": "tenant~availability",
                    "IsHidden": null,
                    "IsMultiValue": false,
                    "Values": [
                        {
                            "StringValue": "Usually Ships in 24 Hours",
                            "Value": "24hrs"
                        }
                    ]
                }
            ],
            "Quantity": 1,
            "Reason": null,
            "ShippingAmount": 15.0,
            "ShippingDiscount": null,
            "ShippingDiscounts": [],
            "VariantProductCode": null
        }
    ],
    "OrderDate": "0001-01-01T00:00:00.000Z",
    "OrderDiscount": {
        "CouponCode": "SUMMER10",
        "CouponSetId": null,
        "Discount": {
            "Amount": 0.0,
            "AmountType": null,
            "Condition": null,
            "DiscountId": 0,
            "DoesNotApplyToMultiShipToOrders": null,
            "DoesNotApplyToProductsWithSalePrice": false,
            "ExpirationDate": "2018-08-17T12:54:00.000Z",
            "FriendlyDescription": null,
            "IncludedPriceLists": null,
            "MaxDiscountValuePerRedemption": null,
            "MaxRedemptions": null,
            "MaximumDiscountValuePerOrder": null,
            "MaximumRedemptionsPerOrder": null,
            "MaximumUsesPerUser": null,
            "Name": "SUMMER SALE ",
            "Redemptions": 0,
            "RequiresAuthenticatedUser": false,
            "Scope": null,
            "StackingLayer": 0,
            "Target": null,
            "Type": null
        },
        "Impact": 10.0
    },
    "OrderDiscounts": [
        {
            "CouponCode": "SUMMER10",
            "CouponSetId": null,
            "Discount": {
                "Amount": 0.0,
                "AmountType": null,
                "Condition": null,
                "DiscountId": 0,
                "DoesNotApplyToMultiShipToOrders": null,
                "DoesNotApplyToProductsWithSalePrice": false,
                "ExpirationDate": "2018-08-17T12:54:00.000Z",
                "FriendlyDescription": null,
                "IncludedPriceLists": null,
                "MaxDiscountValuePerRedemption": null,
                "MaxRedemptions": null,
                "MaximumDiscountValuePerOrder": null,
                "MaximumRedemptionsPerOrder": null,
                "MaximumUsesPerUser": null,
                "Name": "SUMMER SALE ",
                "Redemptions": 0,
                "RequiresAuthenticatedUser": false,
                "Scope": null,
                "StackingLayer": 0,
                "Target": null,
                "Type": null
            },
            "Impact": 10.0
        }
    ],
    "OrderId": "0c5f92f8153e1e3a186b8b1700006323",
    "OrderNumber": 51,
    "OriginalDocumentCode": "51",
    "OriginalOrderDate": "2018-07-30T19:19:58.346Z",
    "ShippingAmount": 105.0,
    "ShippingDiscount": null,
    "ShippingDiscounts": null,
    "ShippingMethodCode": "cf36feeccb4540aaa569dca206f25c6d",
    "ShippingMethodName": "Flat Rate",
    "TaxContext": {
        "CustomerId": "1003",
        "DestinationAddress": {
            "Address1": "15303 Dallas Pkwy",
            "Address2": "#300",
            "Address3": "",
            "Address4": "",
            "AddressType": "Residential",
            "CityOrTown": "Addison",
            "CountryCode": "US",
            "IsValidated": false,
            "PostalOrZipCode": "75001",
            "StateOrProvince": "TX"
        },
        "OriginAddress": {
            "Address1": "1835 Kramer Lane",
            "Address2": "#100",
            "Address3": null,
            "Address4": null,
            "AddressType": null,
            "CityOrTown": "Austin",
            "CountryCode": "US",
            "IsValidated": false,
            "PostalOrZipCode": "78758",
            "StateOrProvince": "TX"
        },
        "TaxContextId": "51",
        "TaxExemptId": null
    },
    "TaxRequestType": "Order"
}
